from settings import CHANNEL_ID

WELCOME_MESSAGE = f"""Добро пожаловать! Данный бот предназначен для публикаций постов в канал: {CHANNEL_ID}\n\n
Пожалуйста, зарегистрируйтесь, чтобы продолжить."""

REGISTRATION_NAME = "Введите имя, которое будет отображаться на ваших постах:"
REGISTRATION_SUCCESS = "Регистрация успешно завершена! Теперь вы можете публиковать посты в канал"

POST_MESSAGE = """Напишите ваш пост:
(Также можно прикреплять фото, видео, аудио, документы и другие файлы)"""

POST_SUCCESS = "Ваш пост успешно опубликован!"

CANCEL_MESSAGE = "Отправка поста отменена."